---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionParametersService
source: html/023078b4-3bd8-62a1-28f8-2f0014b3f044.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionParametersService Property

The external service to view and modify structural connection parameters.

## Syntax (C#)
```csharp
public static ExternalServiceId ModifyConnectionParametersService { get; }
```